#include "gua_info.h"

#include <map>
#include <sstream>

namespace predict {

std::string GuaInfoToString(const GuaInfo& info) {
    std::stringstream ss;
    ss << info.name << ": " << info.desc << ", 参考第" << info.page << "页.";
    return ss.str();
}

// SixYao -> GuaInfo
const static std::map<unsigned char, GuaInfo> kGuaInfoTable = {
    {0x3F, {"乾", "乾为天卦", 168}},
    {0x00, {"坤", "坤为地卦", 177}},
    {0x11, {"屯", "水雷屯卦", 183}},
    {0x22, {"蒙", "山水蒙卦", 188}},
    {0x17, {"需", "水天需卦", 194}},
    {0x3A, {"讼", "天水讼卦", 199}},
    {0x02, {"师", "地水师卦", 204}},
    {0x10, {"比", "水地比卦", 209}},
    {0x37, {"小蓄", "凤天小蓄卦", 214}},
    {0x3B, {"履", "天泽履卦", 219}},
    {0x07, {"泰", "地天泰卦", 224}},
    {0x38, {"否", "天地否卦", 229}},
    {0x3D, {"同人", "天火同人卦", 234}},
    {0x2F, {"大有", "火天大有卦", 239}},
    {0x04, {"谦", "地山谦卦", 244}},
    {0x08, {"豫", "雷地豫卦", 249}},
    {0x19, {"随", "泽雷随卦", 254}},
    {0x26, {"蛊", "山风蛊卦", 259}},
    {0x03, {"临", "地泽临卦", 264}},
    {0x30, {"观", "风地观卦", 269}},
    {0x29, {"噬嗑", "火雷噬嗑卦", 274}},
    {0x25, {"贲", "山火贲卦", 279}},
    {0x20, {"剥", "山地剥卦", 284}},
    {0x01, {"复", "地雷复卦", 289}},
    {0x39, {"无妄", "天雷无妄卦", 294}},
    {0x27, {"大畜", "山天大畜卦", 299}},
    {0x21, {"颐", "山雷颐卦", 304}},
    {0x1E, {"大过", "泽风大过卦", 309}},
    {0x12, {"坎", "坎为水卦", 314}},
    {0x2D, {"离", "离为火卦", 319}},
    {0x1C, {"咸", "泽山咸卦", 324}},
    {0x0E, {"恒", "雷风恒卦", 329}},
    {0x3C, {"遁", "天山遁卦", 334}},
    {0x0F, {"大壮", "雷天大壮卦", 339}},
    {0x28, {"晋", "火地晋卦", 344}},
    {0x05, {"明夷", "地火明夷卦", 349}},
    {0x35, {"家人", "风火家人卦", 354}},
    {0x2B, {"睽", "火泽睽卦", 359}},
    {0x14, {"蹇", "水山蹇卦", 364}},
    {0x0A, {"解", "雷水解卦", 369}},
    {0x23, {"损", "山泽损卦", 374}},
    {0x31, {"益", "风雷益卦", 379}},
    {0x1F, {"夬", "泽天夬卦", 384}},
    {0x3E, {"姤", "天风姤卦", 390}},
    {0x18, {"萃", "泽地萃卦", 395}},
    {0x06, {"升", "地风升卦", 400}},
    {0x1A, {"困", "泽水困卦", 405}},
    {0x16, {"井", "水风井卦", 410}},
    {0x1D, {"革", "泽火革卦", 415}},
    {0x2E, {"鼎", "火风鼎卦", 420}},
    {0x09, {"震", "震为雷卦", 425}},
    {0x24, {"艮", "艮为山卦", 430}},
    {0x34, {"渐", "风山渐卦", 435}},
    {0x0B, {"归妹", "雷泽归妹卦", 440}},
    {0x0D, {"丰", "雷火丰卦", 445}},
    {0x2C, {"旅", "火山旅卦", 450}},
    {0x36, {"巽", "巽为风卦", 455}},
    {0x1B, {"兑", "兑为泽卦", 460}},
    {0x32, {"涣", "风水涣卦", 465}},
    {0x13, {"节", "水泽节卦", 470}},
    {0x33, {"中孚", "风泽中孚卦", 475}},
    {0x0C, {"小过", "雷山小过卦", 480}},
    {0x15, {"既济", "水火既济卦", 485}},
    {0x2A, {"未济", "火水未济卦", 490}}
};

const GuaInfo& GetGuaInfo(unsigned char six_yao) {
    return kGuaInfoTable.at(six_yao);
}

}  // namespace predict
